In [1]:
# Merging DataFrames

In [7]:
import pandas as pd
df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevin', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store1', 'Store1', 'Store3'])
df.head()

        Cost Item Purchased   Name
Store1  22.5         Sponge  Chris
Store1   2.5   Kitty Litter  Kevin
Store3   5.0          Spoon  Filip

In [8]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df.head()

        Cost Item Purchased   Name        Date
Store1  22.5         Sponge  Chris  December 1
Store1   2.5   Kitty Litter  Kevin   January 1
Store3   5.0          Spoon  Filip     mid-May

In [9]:
df['Delivered'] = True
df.head()

        Cost Item Purchased   Name        Date  Delivered
Store1  22.5         Sponge  Chris  December 1       True
Store1   2.5   Kitty Litter  Kevin   January 1       True
Store3   5.0          Spoon  Filip     mid-May       True

In [11]:
df['Feedback'] = ['Positive', None, 'Negative']
df.head()

        Cost Item Purchased   Name        Date  Delivered  Feedback
Store1  22.5         Sponge  Chris  December 1       True  Positive
Store1   2.5   Kitty Litter  Kevin   January 1       True      None
Store3   5.0          Spoon  Filip     mid-May       True  Negative

In [13]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1'})
adf.head()

    index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  Store1  22.5         Sponge  Chris  December 1       True  Positive
1  Store1   2.5   Kitty Litter  Kevin         NaN       True      None
2  Store3   5.0          Spoon  Filip         NaN       True  Negative